Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG01/svd/PIC32CK2051SG01064.svd
               <register>
                  <name>PHY00</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1500</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000019</resetValue>
                  <fields>
                     <field>
                        <name>PREEMP</name>
                        <description>enables pre-emphasis</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>PREEMPSelect</name>
                           <enumeratedValue>
                              <name>SOFEOP</name>
                              <description>Enable pre-emphasis during SOF and EOP</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHIRP</name>
                              <description>Enable pre-emphasis during chirp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NONCHIRP</name>
                              <description>Enable pre-emphasis in non-chirp state</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ALWAYS</name>
                              <description>Always enable pre-emphasis</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SLEWRATE</name>
                        <description>adjust FS/LS slew rate</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWRATESelect</name>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Highest slew rate</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MIDDLE0</name>
                              <description>Middle slew rate</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MIDDLE1</name>
                              <description>Middle slew rate</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SMALLEST</name>
                              <description>Smallest slew rate</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXPHSSEL</name>
                        <description>RX clock phase select</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>RXPHSSELSelect</name>
                           <enumeratedValue>
                              <name>EARLIEST</name>
                              <description>Earliest phase</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LATEST</name>
                              <description>Latest phase</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY04</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1504</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000008F</resetValue>
                  <fields>
                     <field>
                        <name>TXPHSSEL</name>
                        <description>set the Tx clock phase select</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HIZ</name>
                        <description>Set D+/D- to a high impedence state</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SQUELCH210</name>
                        <description>Lower 3 bits of RX squelch trigger point configuration</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY08</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1508</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000007</resetValue>
                  <fields>
                     <field>
                        <name>SQUELCH3</name>
                        <description>MSB of Squelch configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>1</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY0C</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x150C</addressOffset>
                  <size>32</size>
                  <resetValue>0x000000E0</resetValue>
                  <fields>
                     <field>
                        <name>TUNE210</name>
                        <description>Lower 3 bits for HS amplitude tuning</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY10</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1510</addressOffset>
                  <size>32</size>
                  <resetValue>0x000000AA</resetValue>
                  <fields>
                     <field>
                        <name>TUNE76543</name>
                        <description>Upper 5 bits for HS amplitude tuning</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>DRVTUNE210</name>
                        <description>Lower 3 bits for HS/FS/LS driver strength tuning</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY14</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1514</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000012</resetValue>
                  <fields>
                     <field>
                        <name>DRVTUNE43</name>
                        <description>Upper 2 bits for HS/FS/LS driver strength tuning</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>COMPBYPSS</name>
                        <description>Auto compensation bypass</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>BYPSSSQUELCH</name>
                        <description>Bypass squelch trigger point configure in chirp mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ODT0</name>
                        <description>On die termination compensation voltage reference</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY18</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1518</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000008</resetValue>
                  <fields>
                     <field>
                        <name>ODT21</name>
                        <description>Upper 3 bits for on die termination compensation voltage reference</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>2</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY1C</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x151C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000082</resetValue>
                  <fields>
                     <field>
                        <name>ODTBYPASS</name>
                        <description>ODT auto-refresh bypass</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FSLSDIFF</name>
                        <description>Turn off FS/LS differential receiver in suspend mode</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY20</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1520</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000080</resetValue>
                  <fields>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>HSSLEW10</name>
                        <description>Lower 2 bits for HS slew adjust rate</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY24</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1524</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000000C</resetValue>
                  <fields>
                     <field>
                        <name>HSSLEW2</name>
                        <description>MSB of HS slew rate adjust</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSDETEN</name>
                        <description>VBUS Detection Switch 0 - Closed, 1 - Open</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENHLFBITPRE</name>
                        <description>Enable half-bit pre-emphasis for HS transmit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HSPREEMPST</name>
                        <description>HS transmit pre emphasis strength</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>HSDRIVST10</name>
                        <description>HS transmit drive strength</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY28</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1528</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000001B</resetValue>
                  <fields>
                     <field>
                        <name>HSDRIVST2</name>
                        <description>MSB of HS transmit driver strength</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISCONDET</name>
                        <description>HOST disconnects detection trigger point</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>HSDRVCOMP</name>
                        <description>HS drive current compensation voltage reference</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY44</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1544</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000040</resetValue>
                  <fields>
                     <field>
                        <name>PLLDAMP</name>
                        <description>PLL damping factor</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIGDBG</name>
                        <description>Digital debug interface</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRCVBUSVAL</name>
                        <description>Force output vbus_valid</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>4</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>FRCSESSEND</name>
                        <description>force session end</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY48</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1548</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000004</resetValue>
                  <fields>
                     <field>
                        <name>FRCASESSVAL</name>
                        <description>force A_sessionvalid</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FRCBSESSVAL</name>
                        <description>force B_sessionvalid</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSCHRGE</name>
                        <description>VBus charging/discharging bypass</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SESSENDTUNE</name>
                        <description>Session end reference tuning</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY4C</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x154C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>VBUSVALTUNE</name>
                        <description>VBus_valid reference tuning</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>BSESSVALIDTUNE10</name>
                        <description>Lower 2 B_sessionvalid reference tune</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY50</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1550</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>BSESSVALIDTUNE2</name>
                        <description>MSB of B_sessionvalid reference tune</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ASESSVALIDTUNE</name>
                        <description>A_sessionvalid reference tune</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>COMPCURREF</name>
                        <description>Compensation current tuning reference</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <name>ENDPOINT0</name>
               <description>Endpont 0 is selected</description>
               <alternateCluster>ENDPOINTX</alternateCluster>
               <headerStructName>UsbhsEndpoint0</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>USBHS Control Register A. (All bits except ENABLE and SWRST are Enable protected)</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>USBHS Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>USBHS Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDVAL</name>
                        <description>Override Valud of ID</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDOVEN</name>
                        <description>ID Source Select</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>REFCLKSEL</name>
                        <description>Select USB PLL Reference Clock  Speed</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
